<?php
// Задание №3
$box = [
  [
      0 => 'Тетрадь',
      1 => 'Книга',
      2 => 'Настольная игра',
      3 => [
          'Настольная игра',
          'Настольная игра',
      ],
      4 => [
          [
              'Ноутбук',
              'Зарядное устройство'
          ],
          [
              'Компьютерная мышь',
              'Набор проводов',
              [
                  'Фотография',
                  'Картина'
              ]
          ],
          [
              'Инструкция',
              [
                  'Ключ'
              ]
          ]
      ]
  ],
  [
      0 => 'Пакет кошачьего корма',
      1 => [
          'Музыкальный плеер',
          'Книга'
      ]
  ]
];

$result = function($box): array
{
  foreach($box as $value) {
    if($value == 'ключ') {
      return $value;
    } else {
      $result($value);
      return $value;
    }
    
  };
};
$result($box);

